## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:64" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:64" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:e5351978ad30d457e28295e4a9da21c3a0f1aa2362c81c6b9cfea9f43b4ff6b3" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:1e22b10df2b20db424ba2bfaf97b9dc501cfe4d78e6db8609d9a45effa945211"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   systemControls         = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 64 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-cpfValidation will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-cpfValidation" {
      ~ etag                   = "60913aeaecd4a28749c2e9bfea516d68-5" -> "7ddde8c911ed0fc306bcc30d962703f7"
        id                     = "cpfValidation.7ddde8c911ed0fc306bcc30d962703f7.zip"
        tags                   = {}
      ~ version_id             = "Tr0yRDLtGephlX1ndZ4KVT6pdrFLRF_6" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-excelToJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-excelToJson" {
      ~ etag                   = "36f8a7805620df8f3916fa90462f893f-6" -> "041b89efc23b857c9dba4ed86ee811fb"
        id                     = "excelToJson.041b89efc23b857c9dba4ed86ee811fb.zip"
        tags                   = {}
      ~ version_id             = "WxcRtf6bH3kQ6xOqgWz4uS2qyqOnNRII" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-graphql will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-graphql" {
      ~ etag                   = "ed20e0ccfbabc341e78b7496c1b1021b-6" -> "c63b76a94076aa0a0581ba1fa531d2d3"
        id                     = "graphql.c63b76a94076aa0a0581ba1fa531d2d3.zip"
        tags                   = {}
      ~ version_id             = "4lQSK22yH5pLLkR4q9nmMgmI.JZZsR_X" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "7580039b017b738a98d1a9364c763e74" -> "15d8d5d0673cdea26db490341e70bc6d"
        id                     = "dist/200.html"
      ~ source_hash            = "7580039b017b738a98d1a9364c763e74" -> "15d8d5d0673cdea26db490341e70bc6d"
        tags                   = {}
      ~ version_id             = "poW7vwIUelvmaLLuzOR6OsRs_6VT.IF6" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "6c872b3ee6c55b0b38f466168a176b20" -> "c0581b39098537ffadff7e873a534d03"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "6c872b3ee6c55b0b38f466168a176b20" -> "c0581b39098537ffadff7e873a534d03"
        tags                   = {}
      ~ version_id             = "eFW_tlT8t92moP0YsHVzrYG_iG0pn7k3" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "3e11358c279a7861ebb6be7c19b5b785" -> "95102571aa962b357334d1370661f5ee"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "3e11358c279a7861ebb6be7c19b5b785" -> "95102571aa962b357334d1370661f5ee"
        tags                   = {}
      ~ version_id             = "phD5FcwcIeuCiEZ.5YkldjfCSicwv_PY" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "7580039b017b738a98d1a9364c763e74" -> "15d8d5d0673cdea26db490341e70bc6d"
        id                     = "dist/index.html"
      ~ source_hash            = "7580039b017b738a98d1a9364c763e74" -> "15d8d5d0673cdea26db490341e70bc6d"
        tags                   = {}
      ~ version_id             = "0CPtQtFryxxqyNoQdzMRKsTcz6uhQKz3" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.152d361b.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "f7e0415554331c2d3bb99ad3c2c25e4c"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.152d361b.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.152d361b.js"
+       source_hash            = "f7e0415554331c2d3bb99ad3c2c25e4c"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.152d361b.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "b703266ba347d460c07ac79899e011fa"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.152d361b.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.152d361b.js.LICENSE.txt"
+       source_hash            = "b703266ba347d460c07ac79899e011fa"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.fec82830.js"] will be destroyed
  # (because key ["static/js/app.fec82830.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "5d342f74c464a2fada1f037d28a9b80f" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.fec82830.js" -> null
-       key                    = "dist/static/js/app.fec82830.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.fec82830.js" -> null
-       source_hash            = "5d342f74c464a2fada1f037d28a9b80f" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "TRug0TMgatoAg.JYQ38fqfhmTMDKq8Sz" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.fec82830.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.fec82830.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "b703266ba347d460c07ac79899e011fa" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.fec82830.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.fec82830.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.fec82830.js.LICENSE.txt" -> null
-       source_hash            = "b703266ba347d460c07ac79899e011fa" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "BqeYUwVO0nPirGw6OEFxJT3_DAUxpckK" -> null
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:33" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:33/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "33" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "02cdf9cdc7ac87bf6169e973461bc9982cbfd77b" -> "1a3b60020d2e16572dc47fbcfd10931dbe3ffe6f"
              ~ "DD_TAGS"                      = "git.commit.sha:02cdf9cdc7ac87bf6169e973461bc9982cbfd77b,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:1a3b60020d2e16572dc47fbcfd10931dbe3ffe6f,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "02cdf9cdc7ac87bf6169e973461bc9982cbfd77b" -> "1a3b60020d2e16572dc47fbcfd10931dbe3ffe6f"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "33" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-excelToJson"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:33" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:33/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "33" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "02cdf9cdc7ac87bf6169e973461bc9982cbfd77b" -> "1a3b60020d2e16572dc47fbcfd10931dbe3ffe6f"
              ~ "DD_TAGS"                      = "git.commit.sha:02cdf9cdc7ac87bf6169e973461bc9982cbfd77b,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:1a3b60020d2e16572dc47fbcfd10931dbe3ffe6f,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "02cdf9cdc7ac87bf6169e973461bc9982cbfd77b" -> "1a3b60020d2e16572dc47fbcfd10931dbe3ffe6f"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "33" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:80" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:80/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "80" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "02cdf9cdc7ac87bf6169e973461bc9982cbfd77b" -> "1a3b60020d2e16572dc47fbcfd10931dbe3ffe6f"
              ~ "DD_TAGS"                            = "git.commit.sha:02cdf9cdc7ac87bf6169e973461bc9982cbfd77b,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:1a3b60020d2e16572dc47fbcfd10931dbe3ffe6f,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "02cdf9cdc7ac87bf6169e973461bc9982cbfd77b" -> "1a3b60020d2e16572dc47fbcfd10931dbe3ffe6f"
                # (17 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "80" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 6 to add, 11 to change, 6 to destroy.
```

</details>

*Pusher: @dependabot[bot], Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/8481725290)*